artifacts/oscar_e2e/fig4_right_qwen3_4b_thinking/oscar_int2/in100000_bs32/bench_serving.log
benchmark_args=Namespace(backend='sglang', base_url=None, host='127.0.0.1', port=31601, ready_check_timeout_sec=60, dataset_name='generated-shared-prefix', dataset_path='', model=None, served_model_name=None, tokenizer=None, num_prompts=32, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=1024, random_output_len=1024, random_range_ratio=0.0, image_count=1, image_resolution='1080p', random_image_count=False, image_format='jpeg', image_content='random', request_rate=inf, use_trace_timestamps=False, max_concurrency=32, output_file=None, output_details=False, print_requests=False, disable_tqdm=False, disable_stream=False, return_logprob=False, top_logprobs_num=0, token_ids_logprob=None, logprob_start_len=-1, return_routed_experts=False, seed=1, disable_ignore_eos=False, extra_request_body=None, apply_chat_template=False, profile=False, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_start_step=None, profile_steps=None, profile_num_steps=None, profile_by_stage=False, profile_stages=None, profile_output_dir=None, profile_prefix=None, lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=False, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=1, gsp_prompts_per_group=32, gsp_system_prompt_len=100000, gsp_question_len=128, gsp_output_len=1000, gsp_range_ratio=1.0, gsp_fast_prepare=False, gsp_send_routing_key=False, gsp_num_turns=1, gsp_ordered=False, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', tag=None, header=None)
Waiting up to 60s for http://127.0.0.1:31601/v1/models to become ready...
Server ready in 0.0s.
Namespace(backend='sglang', base_url=None, host='127.0.0.1', port=31601, ready_check_timeout_sec=60, dataset_name='generated-shared-prefix', dataset_path='', model='Qwen/Qwen3-4B-Thinking-2507', served_model_name=None, tokenizer=None, num_prompts=32, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=1024, random_output_len=1024, random_range_ratio=0.0, image_count=1, image_resolution='1080p', random_image_count=False, image_format='jpeg', image_content='random', request_rate=inf, use_trace_timestamps=False, max_concurrency=32, output_file=None, output_details=False, print_requests=False, disable_tqdm=False, disable_stream=False, return_logprob=False, top_logprobs_num=0, token_ids_logprob=None, logprob_start_len=-1, return_routed_experts=False, seed=1, disable_ignore_eos=False, extra_request_body=None, apply_chat_template=False, profile=False, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_start_step=None, profile_steps=None, profile_num_steps=None, profile_by_stage=False, profile_stages=None, profile_output_dir=None, profile_prefix=None, lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=False, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=1, gsp_prompts_per_group=32, gsp_system_prompt_len=100000, gsp_question_len=128, gsp_output_len=1000, gsp_range_ratio=1.0, gsp_fast_prepare=False, gsp_send_routing_key=False, gsp_num_turns=1, gsp_ordered=False, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', tag=None, header=None)


Loading cached generated input data from /root/.cache/sglang/benchmark/gen_shared_prefix_1_1_32_100000_128_1000_Qwen2Tokenizer.pkl
Starting warmup with 1 sequences...
Warmup completed with 1 sequences. Starting main benchmark run...

============ Serving Benchmark Result ============
Backend:                                 sglang    
Traffic request rate:                    inf       
Max request concurrency:                 32        
Successful requests:                     32        
Benchmark duration (s):                  110.65    
Total input tokens:                      3371395   
Total input text tokens:                 3371395   
Total generated tokens:                  32000     
Total generated tokens (retokenized):    5403      
Request throughput (req/s):              0.29      
Input token throughput (tok/s):          30468.45  
Output token throughput (tok/s):         289.19    
Peak output token throughput (tok/s):    1720.00   
Peak concurrent requests:                32        
Total token throughput (tok/s):          30757.65  
Concurrency:                             31.09     
----------------End-to-End Latency----------------
Mean E2E Latency (ms):                   107514.99 
Median E2E Latency (ms):                 109003.92 
P90 E2E Latency (ms):                    110441.63 
P99 E2E Latency (ms):                    110568.09 
---------------Time to First Token----------------
Mean TTFT (ms):                          10481.16  
Median TTFT (ms):                        10765.87  
P99 TTFT (ms):                           10932.75  
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          97.13     
Median TPOT (ms):                        98.32     
P99 TPOT (ms):                           99.87     
---------------Inter-Token Latency----------------
Mean ITL (ms):                           97.13     
Median ITL (ms):                         103.77    
P95 ITL (ms):                            104.38    
P99 ITL (ms):                            107.44    
Max ITL (ms):                            5859.80   
==================================================
Warning: You are sending unauthenticated requests to the HF Hub. Please set a HF_TOKEN to enable higher rate limits and faster downloads.

  0%|          | 0/32 [00:00<?, ?it/s]
  3%|▎         | 1/32 [01:38<50:42, 98.13s/it]
  6%|▋         | 2/32 [01:39<20:41, 41.39s/it]
  9%|▉         | 3/32 [01:41<11:11, 23.15s/it]
 12%|█▎        | 4/32 [01:42<06:44, 14.43s/it]
 16%|█▌        | 5/32 [01:43<04:19,  9.59s/it]
 19%|█▉        | 6/32 [01:44<02:51,  6.61s/it]
 22%|██▏       | 7/32 [01:44<01:57,  4.68s/it]
 25%|██▌       | 8/32 [01:45<01:22,  3.43s/it]
 28%|██▊       | 9/32 [01:46<00:59,  2.59s/it]
 31%|███▏      | 10/32 [01:46<00:42,  1.91s/it]
 34%|███▍      | 11/32 [01:47<00:30,  1.45s/it]
 38%|███▊      | 12/32 [01:47<00:22,  1.13s/it]
 41%|████      | 13/32 [01:47<00:16,  1.13it/s]
 44%|████▍     | 14/32 [01:48<00:13,  1.36it/s]
 47%|████▋     | 15/32 [01:48<00:10,  1.64it/s]
 50%|█████     | 16/32 [01:48<00:08,  1.92it/s]
 53%|█████▎    | 17/32 [01:49<00:06,  2.23it/s]
 56%|█████▋    | 18/32 [01:49<00:04,  2.89it/s]
 59%|█████▉    | 19/32 [01:49<00:03,  3.26it/s]
 62%|██████▎   | 20/32 [01:49<00:03,  3.80it/s]
 66%|██████▌   | 21/32 [01:49<00:02,  4.38it/s]
 69%|██████▉   | 22/32 [01:49<00:02,  4.98it/s]
 75%|███████▌  | 24/32 [01:50<00:01,  6.20it/s]
 81%|████████▏ | 26/32 [01:50<00:00,  8.45it/s]
 88%|████████▊ | 28/32 [01:50<00:00,  9.28it/s]
 94%|█████████▍| 30/32 [01:50<00:00, 10.95it/s]
100%|██████████| 32/32 [01:50<00:00,  3.46s/it]